## Code Appendix

In [1]:
# 1. IMPORT LIBRARIES

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# 2. LOAD DATA

df = pd.read_csv("co2_emissions.csv")

# Look at the first 5 rows
df.head()

        Entity Code  Year  Annual CO₂ emissions (per capita)
0  Afghanistan  AFG  1949                           0.001992
1  Afghanistan  AFG  1950                           0.010837
2  Afghanistan  AFG  1951                           0.011625
3  Afghanistan  AFG  1952                           0.011468
4  Afghanistan  AFG  1953                           0.013123

In [3]:
df = pd.read_csv("co2_emissions.csv")
df.columns

Index(['Entity', 'Code', 'Year', 'Annual CO₂ emissions (per capita)'], dtype='object')

In [4]:
df = pd.read_csv("co2_emissions.csv")

df = df.rename(columns={
    "Entity": "Country",
    "Year": "Year",
    "Annual CO₂ emissions (per capita)": "CO2"
})

df.columns

Index(['Country', 'Code', 'Year', 'CO2'], dtype='object')

In [5]:
df = df[["Country", "Year", "CO2"]]
df.head()

       Country  Year       CO2
0  Afghanistan  1949  0.001992
1  Afghanistan  1950  0.010837
2  Afghanistan  1951  0.011625
3  Afghanistan  1952  0.011468
4  Afghanistan  1953  0.013123

In [6]:
# Define countries of interest
countries = ["Germany", "United States", "China", "India", "Australia"]

# Filter the dataset to include only these countries
df_filtered = df[df["Country"].isin(countries)]

# Preview the filtered data
df_filtered.head()

        Country  Year  CO2
1517  Australia  1750  0.0
1518  Australia  1760  0.0
1519  Australia  1770  0.0
1520  Australia  1780  0.0
1521  Australia  1790  0.0

In [7]:
# Sort the data to prepare for time-series analysis
df_filtered = df_filtered.sort_values(by=["Country", "Year"])

In [8]:
# Compute percentage change in CO2 emissions per capita
df_filtered["CO2_change_pct"] = df_filtered.groupby("Country")["CO2"].pct_change() * 100

# Preview the result
df_filtered.head(10)

        Country  Year  CO2  CO2_change_pct
1517  Australia  1750  0.0             NaN
1518  Australia  1760  0.0             NaN
1519  Australia  1770  0.0             NaN
1520  Australia  1780  0.0             NaN
1521  Australia  1790  0.0             NaN
1522  Australia  1800  0.0             NaN
1523  Australia  1801  0.0             NaN
1524  Australia  1802  0.0             NaN
1525  Australia  1803  0.0             NaN
1526  Australia  1804  0.0             NaN

In [9]:
summary = df_filtered.groupby("Country")["CO2"].describe()
summary

,count,mean,std,min,25%,50%,75%,max
Country,,,,,,,,
Australia,230.0,5.749376,6.261364,0.000000,0.184453,3.657280,10.265842,19.055769
China,118.0,1.925319,2.483572,0.039899,0.107790,0.785974,2.651599,8.658390
Germany,225.0,5.881793,4.676867,0.028306,0.878163,5.908997,10.060916,14.302951
India,156.0,0.414751,0.533404,0.001631,0.078294,0.146474,0.520740,2.200978
United States,225.0,10.163691,7.906213,0.042136,1.394424,12.289558,16.929342,22.221300

In [10]:
summary.sort_values("mean", ascending=False)

,count,mean,std,min,25%,50%,75%,max
Country,,,,,,,,
United States,225.0,10.163691,7.906213,0.042136,1.394424,12.289558,16.929342,22.221300
Germany,225.0,5.881793,4.676867,0.028306,0.878163,5.908997,10.060916,14.302951
Australia,230.0,5.749376,6.261364,0.000000,0.184453,3.657280,10.265842,19.055769
China,118.0,1.925319,2.483572,0.039899,0.107790,0.785974,2.651599,8.658390
India,156.0,0.414751,0.533404,0.001631,0.078294,0.146474,0.520740,2.200978

In [11]:
summary.sort_values("max", ascending=False)

,count,mean,std,min,25%,50%,75%,max
Country,,,,,,,,
United States,225.0,10.163691,7.906213,0.042136,1.394424,12.289558,16.929342,22.221300
Australia,230.0,5.749376,6.261364,0.000000,0.184453,3.657280,10.265842,19.055769
Germany,225.0,5.881793,4.676867,0.028306,0.878163,5.908997,10.060916,14.302951
China,118.0,1.925319,2.483572,0.039899,0.107790,0.785974,2.651599,8.658390
India,156.0,0.414751,0.533404,0.001631,0.078294,0.146474,0.520740,2.200978

In [12]:
summary["volatility"] = summary["std"] / summary["mean"]
summary.sort_values("volatility", ascending=False)

,count,mean,std,min,25%,50%,75%,max,volatility
Country,,,,,,,,,
China,118.0,1.925319,2.483572,0.039899,0.107790,0.785974,2.651599,8.658390,1.289953
India,156.0,0.414751,0.533404,0.001631,0.078294,0.146474,0.520740,2.200978,1.286083
Australia,230.0,5.749376,6.261364,0.000000,0.184453,3.657280,10.265842,19.055769,1.089051
Germany,225.0,5.881793,4.676867,0.028306,0.878163,5.908997,10.060916,14.302951,0.795143
United States,225.0,10.163691,7.906213,0.042136,1.394424,12.289558,16.929342,22.221300,0.777888